In [1]:
import pandas as pd
s = pd.Series([20, 30, 40, 50], 
              index=['eve', 'bill', 'liz', 'bob'])
s

eve     20
bill    30
liz     40
bob     50
dtype: int64

In [2]:
s.values

array([20, 30, 40, 50])

In [3]:
s.index

Index(['eve', 'bill', 'liz', 'bob'], dtype='object')

In [4]:
s.loc['eve']

20

In [5]:
animaux = ['chien', 'chat', 'chat', 'chien', 'poisson']
proprio = ['eve', 'bob', 'eve', 'bill', 'liz']

s= pd.Series(animaux, index=proprio)
s

eve       chien
bob        chat
eve        chat
bill      chien
liz     poisson
dtype: object

In [15]:
s.sort_index()

bill      chien
bob        chat
eve       chien
eve        chat
liz     poisson
dtype: object

In [21]:
s = s.sort_index()
s.loc['eve':'liz']

eve      chien
eve       chat
liz    poisson
dtype: object

In [22]:
s

bill      chien
bob        chat
eve       chien
eve        chat
liz     poisson
dtype: object

In [23]:
s.iloc[0]

'chien'

In [24]:
s.iloc[4]

'poisson'

In [26]:
s.iloc[0:3]

bill    chien
bob      chat
eve     chien
dtype: object

In [27]:
s.loc[(s == 'chien') | (s == 'poisson')]

bill      chien
eve       chien
liz     poisson
dtype: object

In [29]:
s.loc[(s == 'chien') | (s == 'poisson')] = 'autre'
s

bill    autre
bob      chat
eve     autre
eve      chat
liz     autre
dtype: object

In [32]:
s1 = pd.Series([1, 2, 3], index=list('abc'))
s2 = pd.Series([5, 6, 7], index=list('acd'))
s1

a    1
b    2
c    3
dtype: int64

In [33]:
s2

a    5
c    6
d    7
dtype: int64

In [34]:
s1 + s2

a    6.0
b    NaN
c    9.0
d    NaN
dtype: float64

In [36]:
s1.add(s2, fill_value=50)

a     6.0
b    52.0
c     9.0
d    57.0
dtype: float64

In [19]:
import pandas as pd
import numpy as np
prenoms = ['liz', 'bob', 'bill', 'eve']
age = pd.Series([25, 30, 35, 40], index=prenoms)
taille = pd.Series([160, 175, 170, 180], index=prenoms)
sexe = pd.Series(list('fhhf'), index=prenoms)
df = pd.DataFrame({'age': age, 
                   'taille': taille, 
                   'sexe': sexe})
df

      age  taille sexe
liz    25     160    f
bob    30     175    h
bill   35     170    h
eve    40     180    f

In [2]:
df.index

Index(['liz', 'bob', 'bill', 'eve'], dtype='object')

In [3]:
df.columns

Index(['age', 'taille', 'sexe'], dtype='object')

In [4]:
df.values

array([[25, 160, 'f'],
       [30, 175, 'h'],
       [35, 170, 'h'],
       [40, 180, 'f']], dtype=object)

In [5]:
df.head(2)

     age  taille sexe
liz   25     160    f
bob   30     175    h

In [6]:
df.tail(2)

      age  taille sexe
bill   35     170    h
eve    40     180    f

In [7]:
df.describe()

             age      taille
count   4.000000    4.000000
mean   32.500000  171.250000
std     6.454972    8.539126
min    25.000000  160.000000
25%    28.750000  167.500000
50%    32.500000  172.500000
75%    36.250000  176.250000
max    40.000000  180.000000

In [8]:
df.loc['liz']

age        25
taille    160
sexe        f
Name: liz, dtype: object

In [9]:
df.loc['liz', 'age']

25

In [10]:
df.loc[:, 'taille']

liz     160
bob     175
bill    170
eve     180
Name: taille, dtype: int64

In [11]:
df.loc[df.loc[:, 'age']<32]

     age  taille sexe
liz   25     160    f
bob   30     175    h

In [12]:
df = df.reset_index()
df

  index  age  taille sexe
0   liz   25     160    f
1   bob   30     175    h
2  bill   35     170    h
3   eve   40     180    f

In [13]:
df = df.rename(columns={'index': 'prenom'})
df

  prenom  age  taille sexe
0    liz   25     160    f
1    bob   30     175    h
2   bill   35     170    h
3    eve   40     180    f

In [14]:
df.set_index('age')

    prenom  taille sexe
age
25     liz     160    f
30     bob     175    h
35    bill     170    h
40     eve     180    f

In [16]:
df = pd.DataFrame({'age': age, 
                   'taille': taille, 
                   'sexe': sexe})
df

      age  taille sexe
liz    25     160    f
bob    30     175    h
bill   35     170    h
eve    40     180    f

In [18]:
df = df.reset_index().rename(columns={'index':'nom'}).set_index('age')
df

      nom  taille sexe
age
25    liz     160    f
30    bob     175    h
35   bill     170    h
40    eve     180    f

In [21]:
df1 = pd.DataFrame(np.ones((2, 2)),
                  index=list('ab'),
                  columns=list('xy'))
df1

     x    y
a  1.0  1.0
b  1.0  1.0

In [22]:
df2 = pd.DataFrame(np.ones((2, 2)),
                  index=list('ac'),
                  columns=list('xz'))
df2

     x    z
a  1.0  1.0
c  1.0  1.0

In [23]:
df1 + df2

     x   y   z
a  2.0 NaN NaN
b  NaN NaN NaN
c  NaN NaN NaN

In [27]:
df3 = df1.add(df2, fill_value = 0)
df3

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0  NaN
c  1.0  NaN  1.0

In [28]:
df3.fillna(-1)

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0 -1.0
c  1.0 -1.0  1.0

In [29]:
df3.dropna()

     x    y    z
a  2.0  1.0  1.0

In [5]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                  columns=list('ab'),
                  index=list('xy'))
df2 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                  columns=list('ab'),
                  index=list('zt'))

   a  b
z  6  2
t  4  5

In [6]:
df1

   a  b
x  8  3
y  8  2

In [7]:
df2

   a  b
z  6  2
t  4  5

In [8]:
pd.concat([df1, df2])

   a  b
x  8  3
y  8  2
z  6  2
t  4  5

In [9]:
df1 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                  columns=list('ab'),
                  index=list('xy'))
df2 = pd.DataFrame(np.random.randint(1, 10, size=(2, 2)),
                  columns=list('cd'),
                  index=list('xy'))

In [10]:
df1

   a  b
x  6  6
y  9  2

In [11]:
df2

   c  d
x  2  4
y  6  6

In [12]:
pd.concat([df1, df2], axis=1)

   a  b  c  d
x  6  6  2  4
y  9  2  6  6

In [19]:
df1 = pd.DataFrame({'personnel' : ['Bob','Lisa','Sue'],
                   'groupe':['SAF', 'R&D', 'RH']})
df2 = pd.DataFrame({'personnel' : ['Lisa', 'Bob', 'Sue'],
                   'date embauche' : [2004, 2008, 2014]})

In [20]:
df1

  personnel groupe
0       Bob    SAF
1      Lisa    R&D
2       Sue     RH

In [21]:
df2

  personnel  date embauche
0      Lisa           2004
1       Bob           2008
2       Sue           2014

In [22]:
pd.merge(df1, df2)

  personnel groupe  date embauche
0       Bob    SAF           2008
1      Lisa    R&D           2004
2       Sue     RH           2014

In [23]:
import pandas as pd
import numpy as np
import seaborn as sns

ti = sns.load_dataset('titanic').loc[:,['survived', 'sex', 
                                       'class']]
ti.head()

/opt/anaconda3/lib/python3.7/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
/opt/anaconda3/lib/python3.7/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
/opt/anaconda3/lib/python3.7/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
/opt/anaconda3/lib/python3.7/importlib/_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

   survived     sex  class
0         0    male  Third
1         1  female  First
2         1  female  Third
3         1  female  First
4         0    male  Third

In [24]:
ti.shape

(891, 3)

In [25]:
ti.loc[:, 'survived'].mean()

0.3838383838383838

In [26]:
ti.loc[ti.loc[:,'class']=='First', 'survived'].mean()

0.6296296296296297

In [28]:
ti.groupby('class').mean()

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [30]:
ti.groupby(['class', 'sex']).mean()

               survived
class  sex
First  female  0.968085
       male    0.368852
Second female  0.921053
       male    0.157407
Third  female  0.500000
       male    0.135447

In [31]:
ti.pivot_table('survived',
              aggfunc=np.mean,
              index='class',
              columns='sex')

sex       female      male
class
First   0.968085  0.368852
Second  0.921053  0.157407
Third   0.500000  0.135447

In [32]:
np.datetime64('2020-03-27 17:56')

numpy.datetime64('2020-03-27T17:56')

In [33]:
pd.to_datetime('27 Mar 2020 17h57')

Timestamp('2020-03-27 17:57:00')

In [34]:
pd.to_datetime(['27 mar 2020', '27-mar-2020'])

DatetimeIndex(['2020-03-27', '2020-03-27'], dtype='datetime64[ns]', freq=None)

In [35]:
index = pd.date_range('1 jan 2018', periods=1000, freq='D')
index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2020-09-17', '2020-09-18', '2020-09-19', '2020-09-20',
               '2020-09-21', '2020-09-22', '2020-09-23', '2020-09-24',
               '2020-09-25', '2020-09-26'],
              dtype='datetime64[ns]', length=1000, freq='D')

In [36]:
index = pd.date_range('1 jan 2018', periods=1000, freq='43h56t')
index

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-02 19:56:00',
               '2018-01-04 15:52:00', '2018-01-06 11:48:00',
               '2018-01-08 07:44:00', '2018-01-10 03:40:00',
               '2018-01-11 23:36:00', '2018-01-13 19:32:00',
               '2018-01-15 15:28:00', '2018-01-17 11:24:00',
               ...
               '2022-12-18 06:00:00', '2022-12-20 01:56:00',
               '2022-12-21 21:52:00', '2022-12-23 17:48:00',
               '2022-12-25 13:44:00', '2022-12-27 09:40:00',
               '2022-12-29 05:36:00', '2022-12-31 01:32:00',
               '2023-01-01 21:28:00', '2023-01-03 17:24:00'],
              dtype='datetime64[ns]', length=1000, freq='2636T')

In [38]:
s = pd.Series(np.random.randint(100, size=1000), index=index)
s

2018-01-01 00:00:00    33
2018-01-02 19:56:00    35
2018-01-04 15:52:00    84
2018-01-06 11:48:00    79
2018-01-08 07:44:00    80
                       ..
2022-12-27 09:40:00    99
2022-12-29 05:36:00    84
2022-12-31 01:32:00    97
2023-01-01 21:28:00    60
2023-01-03 17:24:00    27
Freq: 2636T, Length: 1000, dtype: int64

In [39]:
s['Dec 2018']

2018-12-01 23:48:00    75
2018-12-03 19:44:00    75
2018-12-05 15:40:00     9
2018-12-07 11:36:00    74
2018-12-09 07:32:00    41
2018-12-11 03:28:00    44
2018-12-12 23:24:00    77
2018-12-14 19:20:00    89
2018-12-16 15:16:00    42
2018-12-18 11:12:00    69
2018-12-20 07:08:00    27
2018-12-22 03:04:00    66
2018-12-23 23:00:00    33
2018-12-25 18:56:00    39
2018-12-27 14:52:00    30
2018-12-29 10:48:00    28
2018-12-31 06:44:00    85
Freq: 2636T, dtype: int64

In [40]:
s.resample('M').mean()

2018-01-31    55.470588
2018-02-28    40.375000
2018-03-31    52.294118
2018-04-30    47.125000
2018-05-31    40.000000
                ...
2022-09-30    42.294118
2022-10-31    40.941176
2022-11-30    44.500000
2022-12-31    64.588235
2023-01-31    43.500000
Freq: M, Length: 61, dtype: float64

In [41]:
s.resample('W-WED').mean()   //depuis mercredi chaque semaine

2018-01-03    34.000000
2018-01-10    67.750000
2018-01-17    76.750000
2018-01-24    40.250000
2018-01-31    45.333333
                ...
2022-12-07    56.500000
2022-12-14    80.250000
2022-12-21    44.750000
2022-12-28    63.666667
2023-01-04    67.000000
Freq: W-WED, Length: 262, dtype: float64